import unittest

import bs_mini_dict


class TestMiniDict(unittest.TestCase):

    def setUp(self):
        print('Resdy to test')

    def tearDown(self):
        print('Finish test')

    def test_equal(self):
        expected = {'0': 'No info.', '20001': '狸貓', '20002': '藍瘋兔',
                    '20017': '波利之王', '20003': '搖滾蝗蟲', '20004': '幽靈波利',
                    '20005': '蛙王', '20006': '直升機哥布靈', '20007': '龍蠅',
                    '20008': '流浪之狼', '20020': '枯樹精', '20009': '獅鷲獸',
                    '20018': '安畢斯', '20019': '妖君', '20010': '獸人嬰兒',
                    '20011': '南瓜先生', '20012': '半龍人', '20023': '草精',
                    '20013': '鶚梟首領', '20015': '愛麗絲女僕', '20016': '艾斯恩魔女',
                    '20014': '弑神者', '20022': '迷幻之王', '20024': '大本鐘',
                    '20025': '鐘塔守護者', '20026': '魔靈娃娃', '30011': '虎王',
                    '30012': '俄塞里斯', '30013': '月夜貓', '30014': '獸人英雄',
                    '30024': '犬妖首領', '30015': '死靈', '30023': '阿特羅斯',
                    '30016': '獸人酋長', '30017': '迪塔勒泰晤勒', '30018': '鶚梟男爵',
                    '30020': '血腥騎士', '30021': '巴風特', '30029': '黑暗之王',
                    '30033': '時間管理人', '30034': '斯佩夏爾', '30040': '冰暴騎士'}
        self.assertEqual(expected, bs_mini_dict.mini_dict())


if __name__ == '__main__':
    unittest.main()
